wwwwwrr/BOOST_GD32/examples/GD32F303_DevBoard/software/Utilities/ADC/adc.c
/*!
    \file    adc.c
    \brief   ADC0 监测量与 ADC1 三相电流采样驱动

    \version 2026-7-13, V2.1.0, dual ADC sampling for GD32F30x
*/

#include "adc.h"
#include "interrupt_priority.h"
#include "project_config.h"
#include "systick.h"
#include <stddef.h>

#define ADC_CLOCK_PRESCALER               RCU_CKADC_CKAPB2_DIV4

#define ADC0_DMA_PERIPH                   DMA0
#define ADC0_DMA_CHANNEL                  DMA_CH0
#define ADC0_DMA_RCU                      RCU_DMA0
#define ADC0_DMA_TRANSFER_COUNT           (ADC0_DMA_FRAME_COUNT * \
                                           ADC0_MONITOR_CHANNEL_COUNT)
#define ADC0_SNAPSHOT_BUFFER_COUNT        2U

#define ADC0_OUTPUT_CURRENT_CHANNEL       ADC_CHANNEL_3
#define ADC0_OUTPUT_VOLTAGE_CHANNEL       ADC_CHANNEL_4
#define ADC0_INPUT_VOLTAGE_CHANNEL        ADC_CHANNEL_5
#define ADC0_SAMPLE_TIME                  ADC_SAMPLETIME_71POINT5
#define ADC0_OVERSAMPLING_MODE            ADC_OVERSAMPLING_ALL_CONVERT
#define ADC0_OVERSAMPLING_SHIFT           ADC_OVERSAMPLING_SHIFT_3B
#define ADC0_OVERSAMPLING_RATIO           ADC_OVERSAMPLING_RATIO_MUL8

#define ADC1_PHASE_CHANNEL_COUNT          3U
#define ADC1_PHASE_A_CHANNEL              ADC_CHANNEL_0
#define ADC1_PHASE_B_CHANNEL              ADC_CHANNEL_1
#define ADC1_PHASE_C_CHANNEL              ADC_CHANNEL_2
#define ADC1_PHASE_A_INDEX                0U
#define ADC1_PHASE_B_INDEX                1U
#define ADC1_PHASE_C_INDEX                2U
#define ADC1_RUNTIME_FIRST_PHASE          ADC1_PHASE_B_INDEX
#define ADC1_SAMPLE_TIME                  ADC_SAMPLETIME_7POINT5
#define ADC1_ALL_PHASES_MASK              0x07U

#if (BSP_ADC_PHASE_OFFSET_SAMPLE_ROUNDS == 0U)
#error "ADC1 phase-offset sample rounds must be greater than zero"
#endif

#if (BSP_ADC_PHASE_OFFSET_TIMEOUT_MS == 0U)
#error "ADC1 phase-offset conversion timeout must be greater than zero"
#endif

#if (BSP_ADC_PHASE_OFFSET_SAMPLE_ROUNDS > 1048832U)
#error "ADC1 phase-offset accumulator would overflow uint32_t"
#endif

#define ADC_TRIGGER_TIMER                 TIMER0
#define ADC_TRIGGER_TIMER_RCU             RCU_TIMER0
#define ADC_TRIGGER_TIMER_CLOCK_HZ        120000000U
#define ADC_TRIGGER_FREQUENCY_HZ          100000U
#define ADC_TRIGGER_TIMER_PRESCALER       0U
#define ADC_TRIGGER_PERIOD_COUNTS         (ADC_TRIGGER_TIMER_CLOCK_HZ / \
                                           ADC_TRIGGER_FREQUENCY_HZ)
#define ADC_TRIGGER_TIMER_PERIOD          (ADC_TRIGGER_PERIOD_COUNTS - 1U)
#define ADC_TRIGGER_COMPARE_FROM_PERCENT(percent) \
    ((ADC_TRIGGER_PERIOD_COUNTS * (percent)) / 100U)
#define ADC1_PHASE_B_COMPARE_VALUE \
    ADC_TRIGGER_COMPARE_FROM_PERCENT(BSP_ADC1_PHASE_B_TRIGGER_PERCENT)
#define ADC1_PHASE_C_COMPARE_VALUE \
    ADC_TRIGGER_COMPARE_FROM_PERCENT(BSP_ADC1_PHASE_C_TRIGGER_PERCENT)
#define ADC1_PHASE_A_COMPARE_VALUE \
    ADC_TRIGGER_COMPARE_FROM_PERCENT(BSP_ADC1_PHASE_A_TRIGGER_PERCENT)

#if ((ADC0_DMA_FRAME_COUNT % 2U) != 0U)
#error "ADC0 DMA frame count must be even"
#endif

#if (ADC0_DMA_HALF_FRAME_COUNT != 1U)
#error "ADC0 DMA half transfer must contain exactly one frame"
#endif

#if ((ADC_TRIGGER_TIMER_CLOCK_HZ % ADC_TRIGGER_FREQUENCY_HZ) != 0U)
#error "TIMER0 clock must be an integer multiple of the ADC trigger frequency"
#endif

#if (ADC_TRIGGER_PERIOD_COUNTS > 65536U)
#error "TIMER0 period does not fit the 16-bit counter"
#endif

#if ((BSP_ADC1_PHASE_B_TRIGGER_PERCENT == 0U) || \
     (BSP_ADC1_PHASE_A_TRIGGER_PERCENT >= 100U))
#error "ADC1 trigger percentages must be between 1 and 99"
#endif

#if !((BSP_ADC1_PHASE_B_TRIGGER_PERCENT < \
       BSP_ADC1_PHASE_C_TRIGGER_PERCENT) && \
      (BSP_ADC1_PHASE_C_TRIGGER_PERCENT < \
       BSP_ADC1_PHASE_A_TRIGGER_PERCENT))
#error "ADC1 trigger percentages must be ordered B < C < A"
#endif

#if (ADC1_PHASE_A_COMPARE_VALUE > ADC_TRIGGER_TIMER_PERIOD)
#error "ADC1 phase-A compare value exceeds the TIMER0 period"
#endif

/* ADC0 DMA 直接写入的两帧三通道循环缓冲，通道顺序为 PA3、PA4、PA5。 */
static volatile uint16_t adc0_dma_buffer[ADC0_DMA_FRAME_COUNT]
                                                [ADC0_MONITOR_CHANNEL_COUNT];

/* DMA 中断复制完整硬件平均帧后，供上层读取的 ADC0 双快照缓冲。 */
static volatile adc0_frame_raw_t
    adc0_snapshot_buffer[ADC0_SNAPSHOT_BUFFER_COUNT];
/*
 * ADC0 快照发布状态，不是 DMA 缓冲区：低1位是当前快照索引，
 * 高31位是完整快照发布序号。
 */
static volatile uint32_t adc0_published_state = 0U;
/* ADC1 软件轮转使用的 A/B/C 相通道表。 */
static const uint8_t adc1_phase_channels[ADC1_PHASE_CHANNEL_COUNT] = {
    ADC1_PHASE_A_CHANNEL,
    ADC1_PHASE_B_CHANNEL,
    ADC1_PHASE_C_CHANNEL
};
/* ADC1 A/B/C 采样点对应的 TIMER0_CH0 比较计数值。 */
static const uint16_t
    adc1_phase_compare_values[ADC1_PHASE_CHANNEL_COUNT] = {
        ADC1_PHASE_A_COMPARE_VALUE,
        ADC1_PHASE_B_COMPARE_VALUE,
        ADC1_PHASE_C_COMPARE_VALUE
    };
/* ADC1 A/B/C 各相最近一次转换结果，每次 EOC 中断只更新其中一项。 */
static volatile uint16_t adc1_latest_raw[ADC1_PHASE_CHANNEL_COUNT];
/* ADC1 当前 Rank0 对应的语义相位下标，运行时按 B、C、A 轮转。 */
static volatile uint8_t adc1_current_phase = ADC1_RUNTIME_FIRST_PHASE;
/* CCR 错过更新点后，下一次旧采样点转换只清 EOC、不发布结果。 */
static volatile uint8_t adc1_discard_next_conversion = 0U;
/* ADC1 A/B/C 三相是否至少各完成过一次转换的位掩码。 */
static volatile uint8_t adc1_fresh_phase_mask = 0U;
/* ADC 底层初始化完成标志：1 表示已初始化，0 表示未初始化。 */
static volatile uint8_t adc_initialized = 0U;
/* 双 ADC 采集运行标志：1 表示正在采集，0 表示已停止。 */
static volatile uint8_t adc_running = 0U;

static void ADC_GPIO_Config(void);
static void ADC_DMA_Config(void);
static void ADC_Peripheral_Config(void);
static void ADC_TriggerTimer_Config(void);
static void ADC_TriggerTimer_Reset(void);
static void ADC_ResetRuntimeState(void);
static void ADC1_RuntimePhaseSelect(uint8_t phase);
static void ADC_EnableAndCalibrate(void);
static void ADC0_CopyCompletedFrame(uint32_t source_frame_offset);
static uint8_t ADC1_OffsetCalibration_Init(void);
static void ADC1_OffsetCalibration_DeInit(void);
static uint8_t ADC1_OffsetCalibration_WaitControlBitClear(uint32_t bit);
static uint8_t ADC1_OffsetCalibration_Read(uint8_t channel,
                                           uint16_t *result);

/*!
    \brief      初始化 ADC0、ADC1、DMA 和 ADC1 触发定时器
    \param[in]  无
    \param[out] 无
    \retval     无
*/
void ADC_Init(void)
{
    adc_initialized = 0U;
    adc_running = 0U;

    ADC_GPIO_Config();
    ADC_DMA_Config();
    ADC_TriggerTimer_Config();
    ADC_Peripheral_Config();
    ADC_ResetRuntimeState();

    NVIC_CONFIG(ADC0_1_IRQn,
                ADC0_1_PRIORITY_GROUP,
                ADC0_1_PRIORITY_SUBGROUP);
    NVIC_CONFIG(DMA0_Channel0_IRQn,
                ADC0_DMA_PRIORITY_GROUP,
                ADC0_DMA_PRIORITY_SUBGROUP);

    adc_initialized = 1U;
}

/*!
    \brief      启动 ADC0 连续采集、DMA 和 ADC1 硬件触发采集
    \param[in]  无
    \param[out] 无
    \retval     无
*/
void ADC_Start(void)
{
    if ((adc_initialized == 0U) || (adc_running != 0U)) {
        return;
    }

    ADC_TriggerTimer_Reset();

    dma_channel_disable(ADC0_DMA_PERIPH, ADC0_DMA_CHANNEL);
    dma_memory_address_config(ADC0_DMA_PERIPH,
                              ADC0_DMA_CHANNEL,
                              (uint32_t)adc0_dma_buffer);
    dma_transfer_number_config(ADC0_DMA_PERIPH,
                               ADC0_DMA_CHANNEL,
                               ADC0_DMA_TRANSFER_COUNT);
    dma_interrupt_flag_clear(ADC0_DMA_PERIPH,
                             ADC0_DMA_CHANNEL,
                             DMA_INT_FLAG_G);

    ADC_ResetRuntimeState();
    ADC_EnableAndCalibrate();

    adc_interrupt_flag_clear(ADC1, ADC_INT_FLAG_EOC);
    adc_interrupt_enable(ADC1, ADC_INT_EOC);
    adc_external_trigger_config(ADC1, ADC_ROUTINE_CHANNEL, ENABLE);

    adc_dma_mode_enable(ADC0);
    dma_channel_enable(ADC0_DMA_PERIPH, ADC0_DMA_CHANNEL);

    adc_external_trigger_config(ADC0, ADC_ROUTINE_CHANNEL, ENABLE);
    adc_running = 1U;
    adc_software_trigger_enable(ADC0, ADC_ROUTINE_CHANNEL);
}

/*!
    \brief      停止 ADC0、ADC1、DMA 和 ADC1 触发定时器
    \param[in]  无
    \param[out] 无
    \retval     无
*/
void ADC_Stop(void)
{
    if ((adc_initialized == 0U) || (adc_running == 0U)) {
        return;
    }

    timer_disable(ADC_TRIGGER_TIMER);
    adc_external_trigger_config(ADC1, ADC_ROUTINE_CHANNEL, DISABLE);
    adc_interrupt_disable(ADC1, ADC_INT_EOC);
    adc_external_trigger_config(ADC0, ADC_ROUTINE_CHANNEL, DISABLE);

    adc_dma_mode_disable(ADC0);
    dma_channel_disable(ADC0_DMA_PERIPH, ADC0_DMA_CHANNEL);

    adc_disable(ADC0);
    adc_disable(ADC1);
    adc_running = 0U;
}

/*!
    \brief      独立初始化 ADC1 并以轮询方式测量 A/B/C 三相零电流偏置
    \param[out] result: 三相偏置平均 raw
    \retval     1: 三相偏置测量完成
    \retval     0: 参数无效或任一次转换超时
    \note       本流程不配置中断、DMA 和触发定时器，退出前始终反初始化 ADC1
*/
uint8_t ADC1_CalibratePhaseOffsets(adc1_phase_raw_t *result)
{
    uint32_t phase_sum[ADC1_PHASE_CHANNEL_COUNT] = {0U};
    uint32_t round;                        /*!< 当前校准轮次 */
    uint32_t phase;                        /*!< 当前校准相位下标 */
    uint16_t conversion_value;             /*!< 当前软件触发转换 raw */
    adc1_phase_raw_t calibrated_offset;    /*!< 三相全部完成后的待提交偏置 */
    uint8_t calibration_ok = 0U;           /*!< 三相校准成功标志 */

