wwwwwrr/BOOST_GD32/examples/GD32F303_DevBoard/software/Utilities/ADC/adc.c
    if (result == NULL) {
        return 0U;
    }

    if (ADC1_OffsetCalibration_Init() == 0U) {
        goto calibration_cleanup;
    }

    for (round = 0U;
         round < (BSP_ADC_PHASE_OFFSET_DISCARD_ROUNDS +
                  BSP_ADC_PHASE_OFFSET_SAMPLE_ROUNDS);
         round++) {
        for (phase = 0U; phase < ADC1_PHASE_CHANNEL_COUNT; phase++) {
            if (ADC1_OffsetCalibration_Read(adc1_phase_channels[phase],
                                            &conversion_value) == 0U) {
                goto calibration_cleanup;
            }

            if (round >= BSP_ADC_PHASE_OFFSET_DISCARD_ROUNDS) {
                phase_sum[phase] += conversion_value;
            }
        }
    }

    calibrated_offset.phase_a_raw = (uint16_t)(
        (phase_sum[0] + (BSP_ADC_PHASE_OFFSET_SAMPLE_ROUNDS / 2U)) /
        BSP_ADC_PHASE_OFFSET_SAMPLE_ROUNDS);
    calibrated_offset.phase_b_raw = (uint16_t)(
        (phase_sum[1] + (BSP_ADC_PHASE_OFFSET_SAMPLE_ROUNDS / 2U)) /
        BSP_ADC_PHASE_OFFSET_SAMPLE_ROUNDS);
    calibrated_offset.phase_c_raw = (uint16_t)(
        (phase_sum[2] + (BSP_ADC_PHASE_OFFSET_SAMPLE_ROUNDS / 2U)) /
        BSP_ADC_PHASE_OFFSET_SAMPLE_ROUNDS);
    calibration_ok = 1U;

calibration_cleanup:
    ADC1_OffsetCalibration_DeInit();
    if (calibration_ok != 0U) {
        *result = calibrated_offset;
    }
    return calibration_ok;
}

/*!
    \brief      复制最新完整 ADC0 硬件过采样 raw
    \param[out] result: 输出电流、输出电压和输入电压 raw
    \param[out] sequence: 当前完整数据的发布序号
    \retval     1: 已复制有效数据
    \retval     0: 参数无效或尚无完整数据
*/
uint8_t ADC0_GetLatestRaw(adc0_frame_raw_t *result, uint32_t *sequence)
{
    uint32_t state_before;                 /*!< 复制 raw 前的 ADC0 发布状态 */
    uint32_t sequence_before;              /*!< 本次读取的完整数据序号 */
    uint8_t snapshot_index;                /*!< 当前 ADC0 发布缓冲的数组下标 */

    if ((result == NULL) || (sequence == NULL)) {
        return 0U;
    }


        state_before = adc0_published_state;
        sequence_before = state_before >> 1U;
        if (sequence_before == 0U) {
            return 0U;
        }

        snapshot_index = (uint8_t)(state_before & 1U);
        __DMB();
        result->output_current_raw =
            adc0_snapshot_buffer[snapshot_index].output_current_raw;
        result->output_voltage_raw =
            adc0_snapshot_buffer[snapshot_index].output_voltage_raw;
        result->input_voltage_raw =
            adc0_snapshot_buffer[snapshot_index].input_voltage_raw;
       

   

    *sequence = sequence_before;
    return 1U;
}

/*!
    \brief      读取 ADC1 的 A、B、C 各相最新 raw 数据
    \param[out] result: 三相各自最近一次转换的 raw 数据
    \retval     1: 三相均至少完成过一次转换并已复制数据
    \retval     0: 参数无效或任一相尚未完成转换
*/
uint8_t ADC1_GetLatestRaw(adc1_phase_raw_t *result)
{
    if (result == NULL) {
        return 0U;
    }

    // if (adc1_fresh_phase_mask != ADC1_ALL_PHASES_MASK) {
    //     return 0U;
    // }

    __DMB();
    result->phase_a_raw = adc1_latest_raw[ADC1_PHASE_A_INDEX];
    result->phase_b_raw = adc1_latest_raw[ADC1_PHASE_B_INDEX];
    result->phase_c_raw = adc1_latest_raw[ADC1_PHASE_C_INDEX];
    return 1U;
}

/*!
    \brief      将 PA0～PA5 配置为 ADC 模拟输入
    \param[in]  无
    \param[out] 无
    \retval     无
*/
static void ADC_GPIO_Config(void)
{
    rcu_periph_clock_enable(RCU_GPIOA);
    gpio_init(GPIOA,
              GPIO_MODE_AIN,
              GPIO_OSPEED_50MHZ,
              GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 |
              GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5);
}

/*!
    \brief      配置 ADC0 使用的 DMA0_CH0 两帧循环传输
    \param[in]  无
    \param[out] 无
    \retval     无
*/
static void ADC_DMA_Config(void)
{
    dma_parameter_struct dma_init_struct;  /*!< ADC0 DMA 初始化参数结构体 */

    rcu_periph_clock_enable(ADC0_DMA_RCU);
    dma_deinit(ADC0_DMA_PERIPH, ADC0_DMA_CHANNEL);
    dma_struct_para_init(&dma_init_struct);

    dma_init_struct.periph_addr = (uint32_t)&ADC_RDATA(ADC0);
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
    dma_init_struct.memory_addr = (uint32_t)adc0_dma_buffer;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_16BIT;
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_16BIT;
    dma_init_struct.direction = DMA_PERIPHERAL_TO_MEMORY;
    dma_init_struct.number = ADC0_DMA_TRANSFER_COUNT;
    dma_init_struct.priority = DMA_PRIORITY_HIGH;
    dma_init(ADC0_DMA_PERIPH, ADC0_DMA_CHANNEL, &dma_init_struct);

    dma_circulation_enable(ADC0_DMA_PERIPH, ADC0_DMA_CHANNEL);
    dma_interrupt_enable(ADC0_DMA_PERIPH,
                         ADC0_DMA_CHANNEL,
                         DMA_INT_HTF | DMA_INT_FTF | DMA_INT_ERR);
}

/*!
    \brief      配置 ADC0 连续扫描、硬件8倍过采样和 ADC1 单通道轮转采样
    \param[in]  无
    \param[out] 无
    \retval     无
*/
static void ADC_Peripheral_Config(void)
{
    rcu_periph_clock_enable(RCU_ADC0);
    rcu_periph_clock_enable(RCU_ADC1);
    rcu_adc_clock_config(ADC_CLOCK_PRESCALER);

    adc_deinit(ADC0);
    adc_deinit(ADC1);
    adc_mode_config(ADC_MODE_FREE);

    adc_special_function_config(ADC0, ADC_SCAN_MODE, ENABLE);
    adc_special_function_config(ADC0, ADC_CONTINUOUS_MODE, ENABLE);
    adc_data_alignment_config(ADC0, ADC_DATAALIGN_RIGHT);
    adc_resolution_config(ADC0, ADC_RESOLUTION_12B);
    adc_oversample_mode_config(ADC0,
                               ADC0_OVERSAMPLING_MODE,
                               ADC0_OVERSAMPLING_SHIFT,
                               ADC0_OVERSAMPLING_RATIO);
    adc_oversample_mode_enable(ADC0);
    adc_channel_length_config(ADC0,
                              ADC_ROUTINE_CHANNEL,
                              ADC0_MONITOR_CHANNEL_COUNT);
    adc_routine_channel_config(ADC0,
                               0U,
                               ADC0_OUTPUT_CURRENT_CHANNEL,
                               ADC0_SAMPLE_TIME);
    adc_routine_channel_config(ADC0,
                               1U,
                               ADC0_OUTPUT_VOLTAGE_CHANNEL,
                               ADC0_SAMPLE_TIME);
    adc_routine_channel_config(ADC0,
                               2U,
                               ADC0_INPUT_VOLTAGE_CHANNEL,
                               ADC0_SAMPLE_TIME);
    adc_external_trigger_source_config(ADC0,
                                       ADC_ROUTINE_CHANNEL,
                                       ADC0_1_2_EXTTRIG_ROUTINE_NONE);
    adc_external_trigger_config(ADC0, ADC_ROUTINE_CHANNEL, DISABLE);

