wwwwwrr/BOOST_GD32/examples/GD32F303_DevBoard/software/Utilities/ADC/adc.c
    adc_special_function_config(ADC1, ADC_SCAN_MODE, DISABLE);
    adc_special_function_config(ADC1, ADC_CONTINUOUS_MODE, DISABLE);
    adc_data_alignment_config(ADC1, ADC_DATAALIGN_RIGHT);
    adc_resolution_config(ADC1, ADC_RESOLUTION_12B);
    adc_oversample_mode_disable(ADC1);
    adc_channel_length_config(ADC1,
                              ADC_ROUTINE_CHANNEL,
                              1U);
    /*
     * 运行时只改 Rank0，因此在初始化阶段先为 A/B/C 都配置好采样时间，
     * 最后恢复首次运行相位 B。
     */
    adc_routine_channel_config(ADC1,
                               0U,
                               ADC1_PHASE_A_CHANNEL,
                               ADC1_SAMPLE_TIME);
    adc_routine_channel_config(ADC1,
                               0U,
                               ADC1_PHASE_C_CHANNEL,
                               ADC1_SAMPLE_TIME);
    adc_routine_channel_config(ADC1,
                               0U,
                               ADC1_PHASE_B_CHANNEL,
                               ADC1_SAMPLE_TIME);
    adc_discontinuous_mode_config(ADC1,
                                  ADC_CHANNEL_DISCON_DISABLE,
                                  1U);
    adc_external_trigger_source_config(ADC1,
                                       ADC_ROUTINE_CHANNEL,
                                       ADC0_1_EXTTRIG_ROUTINE_T0_CH0);
    adc_external_trigger_config(ADC1, ADC_ROUTINE_CHANNEL, DISABLE);
    adc_interrupt_disable(ADC1, ADC_INT_EOC);
}

/*!
    \brief      配置 TIMER0 为 ADC1 的 100 kHz 硬件触发从定时器
    \param[in]  无
    \param[out] 无
    \retval     无
*/
static void ADC_TriggerTimer_Config(void)
{
    timer_parameter_struct timer_init_struct;       /*!< TIMER0 基础计数参数 */
    timer_oc_parameter_struct timer_oc_struct;      /*!< TIMER0 CH0 输出比较参数 */

    rcu_periph_clock_enable(ADC_TRIGGER_TIMER_RCU);
    timer_deinit(ADC_TRIGGER_TIMER);

    timer_struct_para_init(&timer_init_struct);
    timer_init_struct.prescaler = ADC_TRIGGER_TIMER_PRESCALER;
    timer_init_struct.alignedmode = TIMER_COUNTER_EDGE;
    timer_init_struct.counterdirection = TIMER_COUNTER_UP;
    timer_init_struct.period = ADC_TRIGGER_TIMER_PERIOD;
    timer_init_struct.clockdivision = TIMER_CKDIV_DIV1;
    timer_init_struct.repetitioncounter = 0U;
    timer_init(ADC_TRIGGER_TIMER, &timer_init_struct);

    timer_channel_output_struct_para_init(&timer_oc_struct);
    //硬件触发必须开启通道
    timer_oc_struct.outputstate = TIMER_CCX_ENABLE;
    timer_oc_struct.outputnstate = TIMER_CCXN_DISABLE;
    timer_oc_struct.ocpolarity = TIMER_OC_POLARITY_HIGH;
    timer_oc_struct.ocnpolarity = TIMER_OCN_POLARITY_HIGH;
    timer_oc_struct.ocidlestate = TIMER_OC_IDLE_STATE_LOW;
    timer_oc_struct.ocnidlestate = TIMER_OCN_IDLE_STATE_LOW;
    timer_channel_output_config(ADC_TRIGGER_TIMER,
                                TIMER_CH_0,
                                &timer_oc_struct);
                                //硬件触发必须是TIMER_OC_MODE_PWM1
    timer_channel_output_mode_config(ADC_TRIGGER_TIMER,
                                     TIMER_CH_0,
                                     TIMER_OC_MODE_PWM1);
    timer_channel_output_shadow_config(ADC_TRIGGER_TIMER,
                                       TIMER_CH_0,
                                       TIMER_OC_SHADOW_ENABLE);
    timer_channel_output_pulse_value_config(ADC_TRIGGER_TIMER,
                                            TIMER_CH_0,
                                            ADC1_PHASE_B_COMPARE_VALUE);

    timer_auto_reload_shadow_enable(ADC_TRIGGER_TIMER);
    //必须开启输出模式
    timer_primary_output_config(ADC_TRIGGER_TIMER, ENABLE);

    timer_input_trigger_source_select(ADC_TRIGGER_TIMER,
                                      TIMER_SMCFG_TRGSEL_ITI3);
    timer_slave_mode_select(ADC_TRIGGER_TIMER, TIMER_SLAVE_MODE_EVENT);
    timer_event_software_generate(ADC_TRIGGER_TIMER, TIMER_EVENT_SRC_UPG);
    timer_counter_value_config(ADC_TRIGGER_TIMER, 0U);
    timer_disable(ADC_TRIGGER_TIMER);
}

/*!
    \brief      复位 TIMER0 的首个 B 相采样点及计数器
    \param[in]  无
    \param[out] 无
    \retval     无
*/
static void ADC_TriggerTimer_Reset(void)
{
    timer_disable(ADC_TRIGGER_TIMER);
    timer_channel_output_pulse_value_config(ADC_TRIGGER_TIMER,
                                            TIMER_CH_0,
                                            ADC1_PHASE_B_COMPARE_VALUE);
    timer_event_software_generate(ADC_TRIGGER_TIMER, TIMER_EVENT_SRC_UPG);
    timer_counter_value_config(ADC_TRIGGER_TIMER, 0U);
}

/*!
    \brief      清除 ADC0 和 ADC1 的底层快照发布状态
    \param[in]  无
    \param[out] 无
    \retval     无
*/
static void ADC_ResetRuntimeState(void)
{
    uint32_t phase;                        /*!< ADC1 A/B/C 三相通道循环下标 */

    adc0_published_state = 0U;

    ADC1_RuntimePhaseSelect(ADC1_RUNTIME_FIRST_PHASE);
    adc1_discard_next_conversion = 0U;
    adc1_fresh_phase_mask = 0U;
    for (phase = 0U; phase < ADC1_PHASE_CHANNEL_COUNT; phase++) {
        adc1_latest_raw[phase] = 0U;
    }
}

/*!
    \brief      仅切换 ADC1 Rank0 通道，采样时间已在初始化阶段配置
    \param[in]  phase: ADC1_PHASE_x_INDEX
    \param[out] 无
    \retval     无
*/
static void ADC1_RuntimePhaseSelect(uint8_t phase)
{
    uint32_t routine_sequence;             /*!< ADC1 规则序列 Rank0 配置 */

    routine_sequence = ADC_RSQ2(ADC1);
    routine_sequence &= ~((uint32_t)ADC_RSQX_RSQN);
    routine_sequence |= (uint32_t)adc1_phase_channels[phase];
    ADC_RSQ2(ADC1) = routine_sequence;
    adc1_current_phase = phase;
}

/*!
    \brief      使能并校准 ADC0 和 ADC1
    \param[in]  无
    \param[out] 无
    \retval     无
*/
static void ADC_EnableAndCalibrate(void)
{
    adc_enable(ADC0);
    adc_enable(ADC1);
    delay_1ms(1U);
    adc_calibration_enable(ADC0);
    adc_calibration_enable(ADC1);
}

/*!
    \brief      临时配置 ADC1 为单通道软件触发轮询采样
    \param[in]  无
    \param[out] 无
    \retval     1: ADC1 自校准完成
    \retval     0: ADC1 自校准超时
*/
static uint8_t ADC1_OffsetCalibration_Init(void)
{
    rcu_periph_clock_enable(RCU_GPIOA);
    gpio_init(GPIOA,
              GPIO_MODE_AIN,
              GPIO_OSPEED_50MHZ,
              GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2);

    rcu_periph_clock_enable(RCU_ADC1);
    rcu_adc_clock_config(ADC_CLOCK_PRESCALER);
    adc_deinit(ADC1);

