wwwwwrr/BOOST_GD32/examples/GD32F303_DevBoard/software/Utilities/ADC/adc.c
    adc_special_function_config(ADC1, ADC_SCAN_MODE, DISABLE);
    adc_special_function_config(ADC1, ADC_CONTINUOUS_MODE, DISABLE);
    adc_data_alignment_config(ADC1, ADC_DATAALIGN_RIGHT);
    adc_resolution_config(ADC1, ADC_RESOLUTION_12B);
    adc_oversample_mode_disable(ADC1);
    adc_channel_length_config(ADC1, ADC_ROUTINE_CHANNEL, 1U);
    adc_routine_channel_config(ADC1,
                               0U,
                               ADC1_PHASE_A_CHANNEL,
                               ADC1_SAMPLE_TIME);
    adc_external_trigger_source_config(ADC1,
                                       ADC_ROUTINE_CHANNEL,
                                       ADC0_1_2_EXTTRIG_ROUTINE_NONE);
    adc_external_trigger_config(ADC1, ADC_ROUTINE_CHANNEL, ENABLE);
    adc_interrupt_disable(ADC1, ADC_INT_EOC);
    adc_flag_clear(ADC1, ADC_FLAG_EOC | ADC_FLAG_STRC);

    adc_enable(ADC1);
    delay_1ms(1U);

    ADC_CTL1(ADC1) |= ADC_CTL1_RSTCLB;
    if (ADC1_OffsetCalibration_WaitControlBitClear(ADC_CTL1_RSTCLB) == 0U) {
        return 0U;
    }

    ADC_CTL1(ADC1) |= ADC_CTL1_CLB;
    if (ADC1_OffsetCalibration_WaitControlBitClear(ADC_CTL1_CLB) == 0U) {
        return 0U;
    }

    return 1U;
}

/*!
    \brief      清理临时 ADC1 偏置校准硬件状态
    \param[in]  无
    \param[out] 无
    \retval     无
*/
static void ADC1_OffsetCalibration_DeInit(void)
{
    adc_external_trigger_config(ADC1, ADC_ROUTINE_CHANNEL, DISABLE);
    adc_interrupt_disable(ADC1, ADC_INT_EOC);
    adc_flag_clear(ADC1, ADC_FLAG_EOC | ADC_FLAG_STRC);
    adc_disable(ADC1);
    adc_deinit(ADC1);
    rcu_periph_clock_disable(RCU_ADC1);
}

/*!
    \brief      带超时等待 ADC1 自校准控制位由硬件清零
    \param[in]  bit: ADC_CTL1_RSTCLB 或 ADC_CTL1_CLB
    \param[out] 无
    \retval     1: 控制位已清零
    \retval     0: 等待超时
*/
static uint8_t ADC1_OffsetCalibration_WaitControlBitClear(uint32_t bit)
{
    uint32_t start_tick;                   /*!< 等待开始时的毫秒时基 */

    start_tick = systick_get_tick();
    while ((ADC_CTL1(ADC1) & bit) != 0U) {
        if ((uint32_t)(systick_get_tick() - start_tick) >=
            BSP_ADC_PHASE_OFFSET_TIMEOUT_MS) {
            return 0U;
        }
    }

    return 1U;
}

/*!
    \brief      软件触发并轮询读取一个 ADC1 相电流通道
    \param[in]  channel: ADC_CHANNEL_0、ADC_CHANNEL_1 或 ADC_CHANNEL_2
    \param[out] result: 转换完成后的12位 raw
    \retval     1: 转换完成
    \retval     0: 参数无效或等待 EOC 超时
*/
static uint8_t ADC1_OffsetCalibration_Read(uint8_t channel,
                                           uint16_t *result)
{
    uint32_t start_tick;                   /*!< 当前转换开始时的毫秒时基 */

    if (result == NULL) {
        return 0U;
    }

    adc_routine_channel_config(ADC1, 0U, channel, ADC1_SAMPLE_TIME);
    adc_flag_clear(ADC1, ADC_FLAG_EOC | ADC_FLAG_STRC);
    start_tick = systick_get_tick();
    adc_software_trigger_enable(ADC1, ADC_ROUTINE_CHANNEL);

    while (adc_flag_get(ADC1, ADC_FLAG_EOC) == RESET) {
        if ((uint32_t)(systick_get_tick() - start_tick) >=
            BSP_ADC_PHASE_OFFSET_TIMEOUT_MS) {
            return 0U;
        }
    }

    *result = adc_routine_data_read(ADC1);
    adc_flag_clear(ADC1, ADC_FLAG_EOC | ADC_FLAG_STRC);
    return 1U;
}

/*!
    \brief      将 DMA 已完成的一组三通道数据复制并发布到非活动快照
    \param[in]  source_frame_offset: DMA 循环缓冲中的源帧索引
    \param[out] 无
    \retval     无
*/
// uint16_t b = 0;
static void ADC0_CopyCompletedFrame(uint32_t source_frame_offset)
{
    uint32_t current_state;                /*!< 复制前的 ADC0 快照发布状态 */
    uint32_t next_sequence;                /*!< 本次完整快照的新发布序号 */
    uint8_t destination_snapshot;          /*!< 目标快照数组下标，不是数据缓冲区 */

    current_state = adc0_published_state;
    destination_snapshot = (uint8_t)((current_state & 1U) ^ 1U);
    adc0_snapshot_buffer[destination_snapshot].output_current_raw =
        adc0_dma_buffer[source_frame_offset][0];
    adc0_snapshot_buffer[destination_snapshot].output_voltage_raw =
        adc0_dma_buffer[source_frame_offset][1];
    adc0_snapshot_buffer[destination_snapshot].input_voltage_raw =
        adc0_dma_buffer[source_frame_offset][2];
        //测试
        // if (adc0_snapshot_buffer[destination_snapshot].output_current_raw >
        //     4096U) {
        //         b = adc0_snapshot_buffer[destination_snapshot].output_current_raw;
        //     }
    

    __DMB();
    next_sequence = (current_state >> 1U) + 1U;
    adc0_published_state = (next_sequence << 1U) | destination_snapshot;
}

/*!
    \brief      处理 ADC0 DMA 半满、全满和传输错误中断
    \param[in]  无
    \param[out] 无
    \retval     无
*/
void ADC_DMA_IRQHandler_Internal(void)
{
    FlagStatus half_transfer_flag;         /*!< ADC0 DMA 半传输完成标志 */
    FlagStatus full_transfer_flag;         /*!< ADC0 DMA 全传输完成标志 */

    if (dma_interrupt_flag_get(ADC0_DMA_PERIPH,
                               ADC0_DMA_CHANNEL,
                               DMA_INT_FLAG_ERR) != RESET) {
        dma_interrupt_flag_clear(ADC0_DMA_PERIPH,
                                 ADC0_DMA_CHANNEL,
                                 DMA_INT_FLAG_ERR);
    }

    half_transfer_flag = dma_interrupt_flag_get(ADC0_DMA_PERIPH,
                                                 ADC0_DMA_CHANNEL,
                                                 DMA_INT_FLAG_HTF);
    full_transfer_flag = dma_interrupt_flag_get(ADC0_DMA_PERIPH,
                                                 ADC0_DMA_CHANNEL,
                                                 DMA_INT_FLAG_FTF);

    /* 两个标志同时积压时，只有后半帧仍能保证未被循环 DMA 覆盖。 */
    if (full_transfer_flag != RESET) {
        dma_interrupt_flag_clear(ADC0_DMA_PERIPH,
                                 ADC0_DMA_CHANNEL,
                                 DMA_INT_FLAG_FTF);
        if (half_transfer_flag != RESET) {
            dma_interrupt_flag_clear(ADC0_DMA_PERIPH,
                                     ADC0_DMA_CHANNEL,
                                     DMA_INT_FLAG_HTF);
        }
        ADC0_CopyCompletedFrame(ADC0_DMA_HALF_FRAME_COUNT);
    } else if (half_transfer_flag != RESET) {
        dma_interrupt_flag_clear(ADC0_DMA_PERIPH,
                                 ADC0_DMA_CHANNEL,
                                 DMA_INT_FLAG_HTF);
        ADC0_CopyCompletedFrame(0U);
    }
}

/*!
    \brief      处理 ADC1 单通道转换完成中断并更新对应相位最新值
    \param[in]  无
    \param[out] 无
    \retval     无
*/
void ADC1_IRQHandler_Internal(void)
{
    uint16_t conversion_value;             /*!< 当前 EOC 对应的 ADC1 转换结果 */
    uint16_t completed_compare;             /*!< 当前相位使用的 TIMER0 比较值 */
    uint16_t trigger_counter;               /*!< 读取结果时的 TIMER0 计数值 */
    uint8_t completed_phase;               /*!< 当前结果对应的相位下标 */
    uint8_t next_phase;                    /*!< 下一次触发需要转换的相位下标 */

    if (adc_interrupt_flag_get(ADC1, ADC_INT_FLAG_EOC) == RESET) {
        return;
    }

    conversion_value = adc_routine_data_read(ADC1);
    trigger_counter = (uint16_t)timer_counter_read(ADC_TRIGGER_TIMER);
    adc_interrupt_flag_clear(ADC1, ADC_INT_FLAG_EOC);

    /*
     * A@96% 转换完成时 TIMER0 已越过更新点；旧的 96% CCR 会再触发一次。
     * 此次结果只用于清除 EOC，下一相通道和 CCR 已在上次有效中断中准备好。
     */
    if (adc1_discard_next_conversion != 0U) {
        adc1_discard_next_conversion = 0U;
        return;
    }

    completed_phase = adc1_current_phase;
    completed_compare = adc1_phase_compare_values[completed_phase];
    next_phase = (uint8_t)(completed_phase + 1U);
    if (next_phase >= ADC1_PHASE_CHANNEL_COUNT) {
        next_phase = 0U;
    }

    /*
     * 先完成下一相的通道和影子 CCR 配置，再发布本次结果。
     * 若计数器已经回绕，说明本次写入错过更新点，下一次转换必须丢弃。
     */
    ADC1_RuntimePhaseSelect(next_phase);
    TIMER_CH0CV(ADC_TRIGGER_TIMER) =
        (uint32_t)adc1_phase_compare_values[next_phase];
    if (trigger_counter < completed_compare) {
        adc1_discard_next_conversion = 1U;
    }

    adc1_latest_raw[completed_phase] = conversion_value;
    __DMB();
    adc1_fresh_phase_mask |= (uint8_t)(1U << completed_phase);
}
